app/controllers/carts_controller.rb

  def destroy
    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 25]]