app/controllers/products_controller.rb

UPDATE "products" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "Rails, Angular, Postgres, and Bootstrap"], ["description", "Powerful, Effective, and Effect Full-stack Web Developer"], ["updated_at", "2019-05-20 04:01:23.727921"], ["id", 2]]
SELECT "products".* FROM "products"
---
  def update
    respond_to do |format|
      if @product.update(product_params)
        format.html { redirect_to @product, notice: 'Product was successfully updated.' }
        format.json { render :show, status: :ok, location: @product }

        @products = Product.all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" INNER JOIN "line_items" ON "orders"."id" = "line_items"."order_id" WHERE "line_items"."product_id" = ? ORDER BY "orders"."updated_at" DESC LIMIT ?  [["product_id", 3], ["LIMIT", 1]]
---
  def who_bought
    @product = Product.find(params[:id])
    @latest_order = @product.orders.order(:updated_at).last